/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   fillit-map.h                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hgranule <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/04/29 04:58:58 by hgranule          #+#    #+#             */
/*   Updated: 2019/04/29 07:25:28 by hgranule         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef TETRIS_MAP_H
# define TETRIS_MAP_H

# include "libft.h"
# include "fillit-input.h"

/*
** Функция принимает карту(массив), приимает фигуру, массив координат
** и символ который идентифицирует фигуру.
** Функция рисует на карте фигурку нужным символом.
** Должны передоваться координаты верхнего левого угла поля 4х4(фигура).
*/
void	draw_tmap(char map[MS][MS + 1], unsigned short tetr, \
int crd[2], char c);

#endif